{"class_name": "Model", "keras_version": "2.0.8-tf", "backend": "tensorflow", "config": {"name": "model_2", "output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 299, 299, 3]}}, {"name": "block1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "strides": [2, 2], "name": "block1_conv1", "bias_constraint": null, "kernel_constraint": null, "trainable": false, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "padding": "valid", "use_bias": false, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block1_conv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block1_conv1_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "block1_conv1_act", "class_name": "Activation", "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]], "config": {"name": "block1_conv1_act", "dtype": "float32", "activation": "relu", "trainable": false}}, {"name": "block1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "strides": [1, 1], "name": "block1_conv2", "bias_constraint": null, "kernel_constraint": null, "trainable": false, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "padding": "valid", "use_bias": false, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block1_conv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block1_conv2_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "block1_conv2_act", "class_name": "Activation", "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]], "config": {"name": "block1_conv2_act", "dtype": "float32", "activation": "relu", "trainable": false}}, {"name": "block2_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block2_sepconv1", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": false}}, {"name": "block2_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block2_sepconv1_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "block2_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block2_sepconv2_act", "dtype": "float32", "activation": "relu", "trainable": false}}, {"name": "block2_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block2_sepconv2", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": false}}, {"name": "block2_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block2_sepconv2_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "strides": [2, 2], "name": "conv2d_1", "bias_constraint": null, "kernel_constraint": null, "trainable": false, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "padding": "same", "use_bias": false, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [3, 3], "padding": "same", "dtype": "float32", "name": "block2_pool", "data_format": "channels_last", "trainable": false}}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_1", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "add_1", "class_name": "Add", "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "config": {"name": "add_1", "dtype": "float32", "trainable": false}}, {"name": "block3_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "block3_sepconv1_act", "dtype": "float32", "activation": "relu", "trainable": false}}, {"name": "block3_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block3_sepconv1", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": false}}, {"name": "block3_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block3_sepconv1_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "block3_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block3_sepconv2_act", "dtype": "float32", "activation": "relu", "trainable": false}}, {"name": "block3_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block3_sepconv2", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": false}}, {"name": "block3_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block3_sepconv2_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "strides": [2, 2], "name": "conv2d_2", "bias_constraint": null, "kernel_constraint": null, "trainable": false, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "padding": "same", "use_bias": false, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [3, 3], "padding": "same", "dtype": "float32", "name": "block3_pool", "data_format": "channels_last", "trainable": false}}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_2", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "add_2", "class_name": "Add", "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "config": {"name": "add_2", "dtype": "float32", "trainable": false}}, {"name": "block4_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "block4_sepconv1_act", "dtype": "float32", "activation": "relu", "trainable": false}}, {"name": "block4_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block4_sepconv1", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": false}}, {"name": "block4_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block4_sepconv1_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "block4_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block4_sepconv2_act", "dtype": "float32", "activation": "relu", "trainable": false}}, {"name": "block4_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block4_sepconv2", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": false}}, {"name": "block4_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block4_sepconv2_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_size": [1, 1], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "strides": [2, 2], "name": "conv2d_3", "bias_constraint": null, "kernel_constraint": null, "trainable": false, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "padding": "same", "use_bias": false, "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [3, 3], "padding": "same", "dtype": "float32", "name": "block4_pool", "data_format": "channels_last", "trainable": false}}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_3", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "add_3", "class_name": "Add", "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "config": {"name": "add_3", "dtype": "float32", "trainable": false}}, {"name": "block5_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "block5_sepconv1_act", "dtype": "float32", "activation": "relu", "trainable": false}}, {"name": "block5_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block5_sepconv1", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": false}}, {"name": "block5_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block5_sepconv1_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "block5_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block5_sepconv2_act", "dtype": "float32", "activation": "relu", "trainable": false}}, {"name": "block5_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block5_sepconv2", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": true}}, {"name": "block5_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block5_sepconv2_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "block5_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block5_sepconv3_act", "dtype": "float32", "activation": "relu", "trainable": true}}, {"name": "block5_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block5_sepconv3", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": true}}, {"name": "block5_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block5_sepconv3_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "add_4", "class_name": "Add", "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_3", 0, 0, {}]]], "config": {"name": "add_4", "dtype": "float32", "trainable": true}}, {"name": "block6_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "block6_sepconv1_act", "dtype": "float32", "activation": "relu", "trainable": true}}, {"name": "block6_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block6_sepconv1", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": true}}, {"name": "block6_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block6_sepconv1_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "block6_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block6_sepconv2_act", "dtype": "float32", "activation": "relu", "trainable": true}}, {"name": "block6_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block6_sepconv2", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": true}}, {"name": "block6_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block6_sepconv2_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "block6_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block6_sepconv3_act", "dtype": "float32", "activation": "relu", "trainable": true}}, {"name": "block6_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block6_sepconv3", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": true}}, {"name": "block6_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block6_sepconv3_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "add_5", "class_name": "Add", "inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_4", 0, 0, {}]]], "config": {"name": "add_5", "dtype": "float32", "trainable": true}}, {"name": "block7_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "block7_sepconv1_act", "dtype": "float32", "activation": "relu", "trainable": true}}, {"name": "block7_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block7_sepconv1", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": true}}, {"name": "block7_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block7_sepconv1_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "block7_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block7_sepconv2_act", "dtype": "float32", "activation": "relu", "trainable": true}}, {"name": "block7_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block7_sepconv2", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": true}}, {"name": "block7_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block7_sepconv2_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "block7_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block7_sepconv3_act", "dtype": "float32", "activation": "relu", "trainable": true}}, {"name": "block7_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv3_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block7_sepconv3", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": true}}, {"name": "block7_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv3", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block7_sepconv3_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "add_6", "class_name": "Add", "inbound_nodes": [[["block7_sepconv3_bn", 0, 0, {}], ["add_5", 0, 0, {}]]], "config": {"name": "add_6", "dtype": "float32", "trainable": true}}, {"name": "block8_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "block8_sepconv1_act", "dtype": "float32", "activation": "relu", "trainable": true}}, {"name": "block8_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv1_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block8_sepconv1", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": true}}, {"name": "block8_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv1", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block8_sepconv1_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "block8_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block8_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block8_sepconv2_act", "dtype": "float32", "activation": "relu", "trainable": true}}, {"name": "block8_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv2_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block8_sepconv2", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": true}}, {"name": "block8_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv2", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block8_sepconv2_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "block8_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block8_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block8_sepconv3_act", "dtype": "float32", "activation": "relu", "trainable": true}}, {"name": "block8_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv3_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block8_sepconv3", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": true}}, {"name": "block8_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv3", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block8_sepconv3_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "add_7", "class_name": "Add", "inbound_nodes": [[["block8_sepconv3_bn", 0, 0, {}], ["add_6", 0, 0, {}]]], "config": {"name": "add_7", "dtype": "float32", "trainable": true}}, {"name": "block9_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "block9_sepconv1_act", "dtype": "float32", "activation": "relu", "trainable": true}}, {"name": "block9_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv1_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block9_sepconv1", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": true}}, {"name": "block9_sepconv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv1", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block9_sepconv1_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "block9_sepconv2_act", "class_name": "Activation", "inbound_nodes": [[["block9_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block9_sepconv2_act", "dtype": "float32", "activation": "relu", "trainable": true}}, {"name": "block9_sepconv2", "class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv2_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block9_sepconv2", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": true}}, {"name": "block9_sepconv2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv2", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block9_sepconv2_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "block9_sepconv3_act", "class_name": "Activation", "inbound_nodes": [[["block9_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block9_sepconv3_act", "dtype": "float32", "activation": "relu", "trainable": true}}, {"name": "block9_sepconv3", "class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv3_act", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_size": [3, 3], "filters": 728, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "pointwise_constraint": null, "name": "block9_sepconv3", "pointwise_regularizer": null, "bias_regularizer": null, "depthwise_constraint": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "padding": "same", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "scale": 1.0, "seed": null}}, "dtype": "float32", "depthwise_regularizer": null, "trainable": true}}, {"name": "block9_sepconv3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv3", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block9_sepconv3_bn", "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "dtype": "float32", "axis": -1, "scale": true, "center": true}}, {"name": "add_8", "class_name": "Add", "inbound_nodes": [[["block9_sepconv3_bn", 0, 0, {}], ["add_7", 0, 0, {}]]], "config": {"name": "add_8", "dtype": "float32", "trainable": true}}, {"name": "block10_sepconv1_act", "class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "block10_sepconv1_act", "dtype": "float32", "activation": "relu", "trainable": true}}, {"name": "block10_sepconv1", "class_name": "SeparableConv2D", "inbound_nodes": [[["block10_sepconv1_act", 0, 0, {}]]], "config": {"strides": [1, 1], 