{"backend": "tensorflow", "keras_version": "2.0.8-tf", "config": {"input_layers": [["input_4", 0, 0]], "output_layers": [["dense_4", 0, 0]], "name": "model_2", "layers": [{"inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 4, 4, 512], "name": "input_4"}, "name": "input_4", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "flatten_2"}, "name": "flatten_2", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"use_bias": true, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_3", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "units": 256, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu"}, "name": "dense_3", "class_name": "Dense"}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "rate": 0.6, "name": "dropout_2"}, "name": "dropout_2", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"use_bias": true, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_4", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "units": 1, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "sigmoid"}, "name": "dense_4", "class_name": "Dense"}]}, "class_name": "Model"}