{"keras_version": "2.0.8-tf", "config": {"name": "model_1", "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"padding": "same", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": "l2", "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "filters": 64, "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"momentum": 0.99, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "dtype": "float32", "axis": -1, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "epsilon": 0.001, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"padding": "same", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": "l2", "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "filters": 64, "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25, "dtype": "float32"}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "conv2d_3", "config": {"padding": "same", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": "l2", "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "filters": 128, "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"momentum": 0.99, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "dtype": "float32", "axis": -1, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_2", "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "epsilon": 0.001, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "conv2d_4", "config": {"padding": "same", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": "l2", "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "filters": 128, "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "max_pooling2d_2", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25, "dtype": "float32"}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "conv2d_5", "config": {"padding": "same", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": "l2", "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "filters": 256, "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"momentum": 0.99, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "dtype": "float32", "axis": -1, "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_3", "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "epsilon": 0.001, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "conv2d_6", "config": {"padding": "same", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": "l2", "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_6", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "filters": 256, "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "max_pooling2d_3", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_3", "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "dropout_3", "config": {"trainable": true, "name": "dropout_3", "rate": 0.25, "dtype": "float32"}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "flatten_1", "config": {"name": "flatten_1", "dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 1024}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_4", "config": {"trainable": true, "name": "dropout_4", "rate": 0.5, "dtype": "float32"}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "dense_2", "config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 512}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dropout_5", "config": {"trainable": true, "name": "dropout_5", "rate": 0.5, "dtype": "float32"}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "dense_3", "config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_3", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 10}, "class_name": "Dense"}], "output_layers": [["dense_3", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}